; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-13)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 roomb)
(at ball4 room3)
(at ball5 room4)
(at ball6 room4)
(at ball7 room4)
(at ball8 room4)
(at ball9 room4)
(at ball10 room4)
(at ball11 room4)
(at ball12 room4)
(at ball13 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 2 of 13
2. (pick ball3 roomb left)
   deleted: (at ball3 roomb) (free left)
   added: (carry ball3 left)
   goals met: 2 of 13
3. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 2 of 13
4. (pick ball9 room4 right)
   deleted: (at ball9 room4) (free right)
   added: (carry ball9 right)
   goals met: 2 of 13
5. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 2 of 13
6. (drop ball9 rooma right)
   deleted: (carry ball9 right)
   added: (at ball9 rooma) (free right)
   goals met: 3 of 13
7. (drop ball3 rooma left)
   deleted: (carry ball3 left)
   added: (at ball3 rooma) (free left)
   goals met: 4 of 13
8. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 4 of 13
9. (pick ball8 room4 left)
   deleted: (at ball8 room4) (free left)
   added: (carry ball8 left)
   goals met: 4 of 13
10. (pick ball7 room4 right)
   deleted: (at ball7 room4) (free right)
   added: (carry ball7 right)
   goals met: 4 of 13
11. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 4 of 13
12. (drop ball7 rooma right)
   deleted: (carry ball7 right)
   added: (at ball7 rooma) (free right)
   goals met: 5 of 13
13. (drop ball8 rooma left)
   deleted: (carry ball8 left)
   added: (at ball8 rooma) (free left)
   goals met: 6 of 13
14. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 6 of 13
15. (pick ball6 room4 left)
   deleted: (at ball6 room4) (free left)
   added: (carry ball6 left)
   goals met: 6 of 13
16. (pick ball5 room4 right)
   deleted: (at ball5 room4) (free right)
   added: (carry ball5 right)
   goals met: 6 of 13
17. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 6 of 13
18. (drop ball5 rooma right)
   deleted: (carry ball5 right)
   added: (at ball5 rooma) (free right)
   goals met: 7 of 13
19. (drop ball6 rooma left)
   deleted: (carry ball6 left)
   added: (at ball6 rooma) (free left)
   goals met: 8 of 13
20. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 8 of 13
21. (pick ball13 room4 left)
   deleted: (at ball13 room4) (free left)
   added: (carry ball13 left)
   goals met: 8 of 13
22. (pick ball12 room4 right)
   deleted: (at ball12 room4) (free right)
   added: (carry ball12 right)
   goals met: 8 of 13
23. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 8 of 13
24. (drop ball12 rooma right)
   deleted: (carry ball12 right)
   added: (at ball12 rooma) (free right)
   goals met: 9 of 13
25. (drop ball13 rooma left)
   deleted: (carry ball13 left)
   added: (at ball13 rooma) (free left)
   goals met: 10 of 13
26. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 10 of 13
27. (pick ball11 room4 left)
   deleted: (at ball11 room4) (free left)
   added: (carry ball11 left)
   goals met: 10 of 13
28. (pick ball10 room4 right)
   deleted: (at ball10 room4) (free right)
   added: (carry ball10 right)
   goals met: 10 of 13
29. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 10 of 13
30. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 10 of 13
31. (drop ball10 rooma right)
   deleted: (carry ball10 right)
   added: (at ball10 rooma) (free right)
   goals met: 11 of 13
32. (drop ball11 rooma left)
   deleted: (carry ball11 left)
   added: (at ball11 rooma) (free left)
   goals met: 12 of 13
33. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 12 of 13
34. (pick ball4 room3 left)
   deleted: (at ball4 room3) (free left)
   added: (carry ball4 left)
   goals met: 12 of 13
35. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 12 of 13
36. (drop ball4 rooma left)
   deleted: (carry ball4 left)
   added: (at ball4 rooma) (free left)
   goals met: 13 of 13
